[{
  "_id": {
    "$oid": "63e659f026bffc3f508c801b"
  },
  "title": "New PC",
  "sub": "I’ve always dreamed of building my own gaming PC, hoping to end a desktop-gaming existence of painfully long loading screens, laggy gameplay, and dated graphics. I’ve also made every excuse in the book not to do it, instead jumping over to consoles to get my fix of newly released, big-budget games. But as I learned firsthand, there’s no secret entrance to the world of PC building, no black door with a gold star on it guarding an exclusive club for hobbyists and tech gurus. Anyone can build a PC from scratch with a bit of patience and the right guide. For me, that guide was a video game.\nBy the end of last year, my boredom during the pandemic had hit its peak, and after spending dozens of hours researching—and agonizing for weeks over which parts to buy that would best fit my unreal standards and my very-real savings account—I realized that the most helpful tool was a game called PC Building Simulator.\nThe internet is brimming with great resources and guides for enthusiasts, but if you’re brand-new to the world of PC building, the sheer amount of information can be overwhelming. It’s hard to anticipate the questions or issues you might come across once you begin.\n\nI set a budget cap that let me splurge on certain components without getting too out of control.\n\nPC Building Simulator is designed for just such novices. Literally a game about fixing and building personal computers, it presents a catalog of real-life parts from manufacturers like Asus and MSI and accurately reproduces them on a workbench. You can pick out components such as cases or motherboards you’ve had your eye on and inspect them up close with the camera or click around to plug them together.\n\nFor total beginners, there’s a tutorial mode that plops you in front of a workbench and has you build a PC from scratch. You start by holding the mouse down over the side panels of the case to remove them, after which you unscrew the power supply’s mounting bracket. Then, you reach into a pile of parts and pick out, say, the motherboard, where text bubbles appear to point out features such as the hard disk drive’s SATA ports or the chipset. If you click on a bubble, you get a summary for that part: For example, it explains that SATA ports are where hard drives are connected, and that I/O (input/output) ports are where peripherals such as keyboards and mice are plugged in. If you know nothing about PCs, the tutorial is a foolproof way to get familiar quickly.\nBefore trying the game, I had narrowed down which parts to get. (My approach of shopping first and learning how to build second was a bit foolish, but it all worked out in the end.) I wanted a small PC that was light and compact enough to easily move around, but I also wanted power. Despite a deep longing for the best graphics and the fastest performance unlimited money could buy, I couldn’t justify spending many thousands of dollars on this particular project. Instead, I set a budget to splurge on certain components without getting too out of control.\n\nThe GPU market has been dramatically impacted by global component shortages and manufacturing issues, and as a result even mid-tier and lower-end cards have inflated in price or disappeared entirely. That made availability an important variable in my decision making. I elected to use the graphics card from my old computer, an Nvidia GeForce GTX 1660 Ti—a solid card that met my needs well enough to orient my build around it. More important, I already had it.\n\nWith my GPU as a base, I started putting together ideas for potential parts using a website called PCPartPicker. You can research and shop for parts on PCPartPicker, and you can use the site’s filters to find options that work with your existing or planned parts, budget, or other needs. Once I finally felt confident in the choices I had made for my dream build, one looming question remained: Would they all fit?\n\nAlthough it’s easy enough to find size measurements for each part, mapping out the physical placement and clearance for everything is a different challenge if you’ve never gone under the hood of a PC before. That’s where PC Building Simulator saved the day.\nSpending a few hours with PC Building Simulator can be instrumental if you’re new to understanding computers, overwhelmed by the sheer amount of unfamiliar vocabulary, or turned off entirely because you’re unsure about where to start. I still take the time to play certain games or genres on my PlayStation or Nintendo Switch, but after a few months with my new PC, I’m spending a lot more time at my desk for long sessions of World War Z, Valheim, and Dead by Daylight.",
  "thumbSrc": "https://expertreviews.b-cdn.net/sites/expertreviews/files/2022/01/best_gaming_pc_primary.jpg",
  "favorite": true,
  "updatedAt": {
    "$date": "2023-03-06T13:40:34.928Z"
  }
},
{
  "_id": {
    "$oid": "63e659f026bffc3f508c801a"
  },
  "title": "My New Car",
  "sub": "As with the previous generation, the new RS6 is powered by a 4.0-litre twin-turbo TFSI petrol engine, now boosted by a 48V belt alternator/starter mild-hybrid system, which can recover up to 16 bhp (12 kW). The engine also utilises a cylinder-on-demand system that can shut off half of its cylinders to boost fuel economy.  The powertrain produces 600 PS (441 kW; 592 bhp) with 800 N⋅m (590 lbf⋅ft) available between 2100rpm and 4500rpm.  The acceleration to 100 km/h (62 mph) takes 3.6 seconds and 200 km/h (120 mph) in 12 seconds. As standard, top speed is limited to 250 km/h (155 mph), with a further two levels courtesy of optional packs – the Dynamic package allows 280 km/h (174 mph), while the Dynamic package plus grants even more headroom for a maximum of 305 km/h (190 mph). The C8 is the first RS 6 Avant to have the hybrid drivetrain, utilising a Riemen-Starter-Generator and a 48-volt electrical system.[29] The Quattro system has power distribution with 40% for front and 60% for rear. The system can adjust the power distribution up to 70% for front and to 85% for the rear if needed. The adaptive suspension system is 20 mm lower than standard A6 and can lower the vehicle further 10 mm during the high-speed driving or can raise the ride 20 mm at low speed. The Drive Select function gains configurable RS1 and RS2 modes, which are activated by an ‘RS mode’ button positioned on the steering wheel. As well as adjusting the engine and handling responses, they also enable bespoke information on the Virtual Cockpit system.  Under the new Euro-7 emissions law, Chairman of the Management Board of Audi, Herbert Diess recently said \"The RS range set will be the biggest change in the production line since 2004. The new RS range will be the most economical, low emission with the RS6 and Q8 will both have electric hybrid engines to reduce the current emission by 27%.\" The new Electric range will begin production in the Audi Sport GmbH Neckarsulm factory in Germany. The new RS range is set to be in Australia and is said to have a three-cylinder hybrid plug-in, also currently being taken on by Mercedes Benz in order to comply with the new Euro-7 emission law.[30]  The C8 RS 6 Avant will also be sold in North America, the first time that an RS 6 was offered there since the C5-based RS 6. It will be sold alongside the RS 7 Sportback and RS Q8 that share the same powertrain",
  "thumbSrc": "https://hips.hearstapps.com/hmg-prod/images/2022-audi-rs6-avant-mmp-1-1620073915.jpg?crop=0.982xw:0.738xh;0.0112xw,0.178xh&resize=1200:*",
  "favorite": true,
  "updatedAt": {
    "$date": "2023-03-10T13:50:09.591Z"
  }
},
{
  "_id": {
    "$oid": "63e659f026bffc3f508c801c"
  },
  "title": "My travel to Norway",
  "sub": "Norway is known as the head of the Scandinavian peninsula which has the shape as a tiger. It is now famous in the world for its thousands of small and large fjords. Norway is considered one of the world’s most beautiful places to discover the great beauty of the natural wonders dating from the ice age. Norway is the 61st largest country in the world by area, but the population of Norway is just over 5 million. Many of the lands here are not severely impacted by human beings, so it still preserves the wild beauty. Let’s discover the beautiful nation through my trip to Norway blog (Norway trip blog) — Explore Norway: The world of fjords.\nAfter referring the popular “Norway in a Nutshell tour” in Norway, we decided to do a “dust tour” to avoid being “bagged” where the living standard of the people is very high. All costs are quite expensive compared to the UK and France.\nBergen was known as the capital of Norway during the thirteenth century. It has many beautiful natural landscapes as the picture and featured culture. Bergen is the second largest city (just behind Oslo) which is located on the West Coast. The harbor is frequented by fishing boats and cruise ships. It is also the gateway to Norway’s most famous fjords.\nSurrounded by seven mountains, the highest is the Floyen mountain, Bergen is also known as Europe’s largest rainfall city. The old town of Bergen is romantic with steep and small streets which are very quiet. The houses along the slopes are beautiful with the Scandinavian style which is bright and eye catching colors.\nIn Bergen, there is the Bryggen harbor area, which has been recognized by UNESCO as a World Heritage Site since 1979. There are still colorful and featured houses from the early 12th to the 17th centuries. The huts are built opposite the harbor with the frontage facing the wharf, while the back has its own courtyard.\nIt is said that at the beginning of time, these houses were built of wood, later expanded and built of stone to preserve the goods. Since Bergen suffered many fires, most of the buildings were severely damaged.  Bryggen also suffered the same fate. By 1702, there was only about a quarter of the houses and warehouses after the fire. Most of the houses are now built in the twentieth century by the architect Jens Zetlitz Monrad Kielland. Only a few stone basements dating back to the 15th century are retained.\nThis season, the sky of Northern Europe is very blue and clear, while the water which prints the mountain shadow and clouds drift is flat like a mirror. The boat passes through many beautiful towns with colorful houses, surrounded by fresh green mountains. The wonderful scenery makes almost passengers on the ship be quiet to admire as if they fear that a strong breathing can also blur the scene before the eyes.\n",
  "thumbSrc": "https://wallpaperaccess.com/full/307324.jpg",
  "favorite": true,
  "updatedAt": {
    "$date": "2023-03-06T13:40:54.781Z"
  }
},
{
  "_id": {
    "$oid": "6404262326e94d073a5140d6"
  },
  "title": "Welcome to my blog",
  "sub": "Hello all, welcome to my blog",
  "thumbSrc": "https://c0.wallpaperflare.com/preview/101/814/342/aerial-background-beverage-blog.jpg",
  "favorite": false,
  "createdAt": {
    "$date": "2023-03-05T05:18:27.456Z"
  },
  "updatedAt": {
    "$date": "2023-03-06T13:32:44.697Z"
  }
}]